--[[

【矜持之花·大乔】
WU006　KayaK
武将技：
国色——出牌阶段，你可以将你的任意方块花色的牌当【乐不思蜀】使用。
流离——当你成为【杀】的目标时，你可以弃一张牌，并将此【杀】转移给你攻击范围内的另一名角色。（该角色不得是【杀】的使用者）

[Q]大乔是否可以先发动【八卦阵】的效果，判定出黑色了之后再发动【流离】？【A]不可以。
[Q]大乔用作【乐不思蜀】的方块花色的牌，如果被其他玩家使用【顺手牵羊】得到，是否也可以将其当作【乐不思蜀】使用？[A]不可以。只能按照原来的牌使用。
[Q]大乔是否可以将自己面前的方块装备牌当【乐不思蜀】使用？[A]可以。
[Q]大乔如果成为黑色【杀】的目标，是否可以发动【流离】将黑色【杀】转移给攻击范围内给装备了【仁王盾】的角色？[A]可以。但是该【杀】无效。
[Q]大乔是否可以将其装备区的装备牌用于【流离】？[A]可以。但是计算其他角色是否在攻击范围内时，不可以将弃掉的牌算入。
[Q]一名角色A装备【青龙偃月刀】杀大乔，大乔使用【闪】后，A发动武器技能继续对大乔使用【杀】，大乔是否可以发动【流离】转移此【杀】给攻击范围内的角色B？如果可以，B使用【闪】后，若A再次发动武器技能，这是使用【杀】的目标是谁？[A]这种情况下，大乔可以发动【流离】。若B使用【闪】后，A再次发动【青龙偃月刀】的技能，【杀】的目标是B，即使用【闪】的角色。
[Q]大乔装备【仁王盾】受到别人的黑【杀】，能否发动【流离】？[A]能。
[Q]大乔装备【藤甲】受到别人的普杀，能否发动【流离】？[A]能。
--]]

