--[[

【鬼神再临·关羽】
LE001　KayaK
武将技：
武神——锁定技，你的每一张红桃手牌都视为【杀】，你使用红桃的【杀】时无距离限制。
武魂——锁定技，任意角色每对你造成1点伤害，获得一个梦魇标记。你死亡时，令持有最多该标记的一名角色判定：除非结果为【桃】或【桃园结义】，否则该角色立即死亡。

[Q]神关羽死亡时，如果场上有两个或两个以上角色拥有最多的梦魇标记，如何结算？[A]由神关羽指定其中一个角色进行【武魂】的判定。
[Q]被【武魂】技能杀死的角色，能否用【桃】救？[A]立即死亡，不能救。
[Q]杀死反贼神关羽时，是先判定【武魂】还是先摸3张牌？[A]先判定【武魂】。
[Q]如果最后只剩下主公和反贼神关羽，主公杀死神关羽时如何结算？[A]一旦满足游戏结束条件的局面出现，游戏立即结束，所有结算均停止。这种局面下主公获胜。
[Q]如果持有最多梦魇标记的角色比神关羽早死去，那么神关羽死亡时如何结算？[A]剩下活着的角色里拥有最多梦魇标记的人成为【武魂】的对象。
[Q]如果神关羽死亡时，场上没有任何一个角色拥有梦魇标记，能否发动【武魂】？[A]不能发动。
[Q]神关羽算蜀势力角色吗？[A]神武将可以是任何国家的。

--]]

