--[[

【弓腰姬·孙尚香】
WU008　KayaK
武将技：
结姻——出牌阶段，你可以弃两张手牌并指定一名受伤的男性角色：你和目标角色各回复1点体力。每回合限用一次。
★发动结姻的条件是“有受伤的男性角色”，与你是否受伤无关。
枭姬——当你失去一张装备区里的牌时，你可以立即摸两张牌。
★例如这些时机：你受到【顺手牵羊】、【过河拆桥】等锦囊的影响以及你自己替换装备时。

[Q]孙尚香发动【结姻】时，是否可以只为自己回复体力？[A]不可以。
[Q]当场上没有男性角色受伤时，孙尚香是否可以发动【结姻】？[A]不可以。
[Q]孙尚香失去1张装备区里的牌时，是否一定要发动【枭姬】摸两张牌？[A]【枭姬】不是锁定技，可选择性发动。
[Q]孙尚香是否可以替换自己的装备来触发【枭姬】？[A]可以。
[Q]孙尚香是否可以主动弃掉自己装备区里的牌来发动【枭姬】技能？[A]不可以。
[Q]孙尚香发动【贯石斧】的技能时，是否可以弃装备区里的牌发动【枭姬】？[A]可以。但是不能弃掉【贯石斧】本身。
[Q]孙尚香做主公，如果杀掉了忠臣，需要弃光所有牌，此时如果其装备区有牌，孙尚香是否可以发动【枭姬】技能？[A]可以。
例如：孙尚香做主公，对忠臣周瑜使用【杀】导致周瑜死亡，此时孙尚香必须弃掉所有牌。若孙尚香此时装备了【+1马】、【-1马】、【雌雄双股剑】，则在弃掉所有牌后，孙尚香可以发动【枭姬】技能再摸6张牌。

--]]

