--[[

【独眼的罗刹·夏侯惇】
WEI003　KayaK
武将技：
刚烈——你每受到一次伤害，可进行一次判定：若结果不为红桃，则目标来源必须进行二选一：弃两张手牌或受到你对其造成的1点伤害。

[Q]夏侯惇发动【刚烈】时，若判定结果不为红桃，且目标来源不足两张手牌，如何结算？[A]目标来源必须受到1点伤害。
[Q]夏侯惇受到一次超过1点的伤害时，可以发动几次【刚烈】？[A]一次。
例如：许褚发动【裸衣】技能后，使用【杀】攻击夏侯惇，夏侯惇受到2点伤害，此时只能发动一次【刚烈】。
[Q]夏侯惇进入濒死状态时，是否可以发动【刚烈】？[A]不可以，除非夏侯惇被救回。
例如：A角色对夏侯惇使用【杀】，夏侯惇受伤害进入濒死状态，如果没有角色对夏侯惇使用【桃】，则夏侯惇死亡，不能发动【刚烈】。
[Q]夏侯惇【刚烈】小乔，小乔能否继续发动【天香】？[A]可以。
[Q]夏侯惇对小乔造成伤害，小乔把伤害转移给夏侯惇，是否可以发动【刚烈】？[A]可以，但是刚烈的对象是自己。
[Q]夏侯惇受到连环传导的伤害时，刚烈的对象是谁？[A]伤害来源（可以是自己）。
[Q]夏侯惇刚烈对对方造成的伤害是什么属性？[A]普通伤害。

--]]

