--[[

【太平道人·于吉】
QUN011　LiuHeng
武将技：
蛊惑——当你需要使用或打出一张基本牌或非延时类锦囊牌时，你可以声明并将1张手牌扣于桌上。若无人质疑，则该牌按你所述之牌来用。若有人质疑则亮出验明：若为真，质疑者各失去1点体力；若为假，质疑者各摸1张牌。除非被质疑的牌为红桃花色且为真（仍然可用），否则无论真假，该牌都作废，弃置之。

★失去体力没有伤害来源，并且不能触发任何与伤害有关的技能。
★无人质疑时，将用于蛊惑的牌亮开，该牌的颜色即为于吉使用（或打出）这张牌的颜色。
★没有体力的角色不能质疑。

[Q]于吉发动【蛊惑】，别人质疑猜错死亡的话，奖惩如何结算？[A]质疑失败没有伤害来源，因此没有人获得奖励或惩罚。
[Q]于吉发动【蛊惑】，造成玩家失去体力之后，能否发动相关的武将技，比如【天香】、【刚烈】、【奸雄】、【反馈】、【武魂】、【遗计】等？[A]失去体力，没有造成伤害，因此上述技能等均不能发动。
[Q]于吉濒死能否蛊惑吃【桃】？[A]可以。
[Q]于吉蛊惑出【桃】救濒死的角色，如何结算？[A]从当前行动回合的角色开始按逆时针方向依次结算，在于吉【蛊惑】之前放弃出【桃】的玩家，即使通过质疑摸牌摸到了【桃】，也不能再救。在于吉之后的角色如果通过质疑于吉的【蛊惑】摸到了【桃】，可以救。
[Q]对于吉使用【顺手牵羊】或者【过河拆桥】，于吉装备区里没有牌，判定区里有延时锦囊，如果于吉通过【蛊惑】使得手牌张数变为0，如何结算？[A]强制牵（或拆）延时锦囊。
[Q]对于吉使用【顺手牵羊】或者【过河拆桥】，如果于吉通过【蛊惑】使得自己没有任何牌，如何结算？[A]【顺手牵羊】或【过河拆桥】作废，进入弃牌堆。
[Q]于吉能否发动【丈八蛇矛】的特效时【蛊惑】？[A]不能。
[Q]吕布对于吉使用【杀】，于吉发动【蛊惑】出2【闪】，如何结算？[A]2张【闪】依次质疑，顺序由于吉指定。

以下是蛊惑【杀】的相关内容，由zhuyue2323总结、Lee·Lee编写(资料来源)
[Q]于吉蛊惑【杀】不声明属性被人质疑，验明时真假如何判断？[A]只要翻开后为【杀】，则算作真，且【杀】的属性按原牌结算；否则算作假。
[Q]于吉蛊惑【杀】声明属性（无属性/火属性/雷属性）被人质疑，验明时真假如何判断？[A]如果原牌不是【杀】或虽然是【杀】但与声明的属性不同，则算作假；如果原牌是【杀】且属性与声明的相同，则算作真。
[Q]于吉蛊惑【杀】不声明属性无人质疑，此【杀】的属性如何处理？[A]无人质疑时，原牌仍然要翻开。若原牌是【杀】，按原牌属性结算；若原牌不是【杀】，按无属性【杀】结算。
[Q]于吉蛊惑【杀】声明属性（无属性/火属性/雷属性）无人质疑，此【杀】的属性如何处理？[A]无论翻开后的原牌是什么属性，此【杀】均按声明的属性结算。
[Q]于吉蛊惑【杀】时无人质疑，此【杀】的花色如何处理？[A]以翻开后的原牌花色为参照。
[Q]于吉蛊惑无属性【杀】成功，能否发动已装备的【朱雀羽扇】特效？[A]可以，在验明后发动。


--]]

