--[[

【历战之躯·周泰】
WU013　KayaK
武将技：不屈——每当你扣减1点体力后，若你当前的体力值为0：你可以从牌堆顶亮出一张牌置于你的武将牌上，若此牌的点数与你武将牌上已有的任何一张牌都不同，你不会死亡；若出现相同点数的牌，你进入濒死状态。

◆置于武将牌上的牌视为移出游戏。
◆为了简化结算流程，周泰一次扣减多点体力只发动一次【不屈】

举例说明：
============================================
（1）体力为Y的周泰受到X点伤害（X≥Y），在扣减X点体力后体力为Y-X：
1、周泰发动【不屈】，亮出X-Y+1张牌置于其武将牌上：
a、周泰武将牌上没有相同点数的牌则存活，体力为1-Z（Z为此时周泰武将牌上的牌数），其当前的体力值为0。
b、周泰武将牌上出现相同点数的牌则进入濒死状态，体力为1-Z（Z为此时周泰武将牌上的牌数），进行濒死结算，在濒死结算过程中最多可以对周泰使用Z张【桃】/【酒】，周泰每回复1点体力，改为将其武将牌上的任意一张牌置入弃牌堆。出现以下情况濒死结算完毕：
Ⅰ、最后一个进行响应的角色响应完毕后周泰的武将牌上有相同点数的牌，周泰死亡。
Ⅱ、最后一个进行响应的角色响应完毕后周泰的武将牌上没有点数相同的牌，周泰存活，体力为1-Z（Z为此时周泰武将牌上的牌数），其当前的体力值为0。
Ⅲ、周泰将其武将牌上的最后一张牌置入弃牌堆后，周泰存活，其当前的体力值为1。
2、周泰不发动【不屈】，则进入濒死状态，正常进行濒死结算，在濒死结算过程中最多可以对周泰使用X-Y+1张【桃】/【酒】。

（2）武将牌上有Y张牌（即体力为1-Y）的周泰受到X点伤害，在扣减X点体力后体力为1-Y-X：
1、周泰发动【不屈】，亮出X张牌置于其武将牌上：
a、同（1）-1-a。
b、同（1）-1-b。
2、周泰不发动【不屈】，则进入濒死状态，正常进行濒死结算，在濒死结算过程中最多可以对周泰使用X+Y张【桃】/【酒】。
============================================

[Q]周泰亮出的牌司马懿和张角能否替换？[A]不能。不属于判定牌。
[Q]小乔【天香】给不屈状态下的周泰，周泰摸几张牌？[A]等同于体力上限的牌。
[Q]周泰在不屈状态下自己回合结束能保留多少手牌？[A]0张。
[Q]周泰不屈状态下自己使用桃或者受到别人的回血效果时，如何结算？[A]任意弃掉1张状态牌。如果唯一的1张状态牌也被弃掉，则回复到1点体力值。
[Q]周泰在【不屈】状态下进入濒死状态，是否可以求多个桃？[A]可以，直到回复到1点体力值为止。

=============================================================================
以下内容已经过时，仅作为资料供大家比较（毕竟无法保正大家手上的牌是最新版）：

珍藏版牌面：不屈——每当你扣减1点体力时，若你当前体力为0：你可以从牌堆顶亮出一张牌置于你的武将牌上，若该牌的点数与你武将牌上已有的任何一张牌都不同，你不会死亡；若出现相同点数的牌，你进入濒死状态。

原风包牌面：不屈——任何时候，当你的体力被扣减到0或更低时，每扣减1点体力：从牌堆亮出一张牌放在你的武将牌上，若该牌的点数与你武将牌上已有的任何一张牌都不同，你可以不死去。此牌亮出的时刻为你的濒死状态。

--]]

