--[[

【大都督·周瑜】
WU005　KayaK
武将技：
英姿——摸牌阶段，你可以额外摸一张牌。
反间——出牌阶段，你可以令一名其他角色说出一种花色，然后获得你的一张手牌并展示之，若此牌不为其所述之花色，你对该角色造成1点伤害。每阶段限一次。

[Q]小乔抽取周瑜的黑桃，是否算红桃？[A]是，因为此牌为小乔手牌，受【红颜】影响。
[Q]周瑜发动【反间】时，如果有多张手牌，牌的放置顺序由谁决定？[A]由周瑜决定。
[Q]周瑜对小乔发动【反间】，小乔天香给曹操，谁获得周瑜的反间牌？[A]小乔。
[Q]周瑜受到【兵粮寸断】的效果时，能否发动英姿？[A]不能。
[Q]周瑜发动【反间】技能造成的伤害是什么属性？[A]普通伤害。

=============================================================================
以下内容已经过时，仅作为资料供大家比较（毕竟无法保正大家手上的牌是最新版）：

珍藏版牌面：反间——出牌阶段，你可以指定一名其他角色，该角色选择一种花色后获得你的一张手牌并展示之，若此牌与所选花色不同，则你对该角色造成1点伤害。每阶段限一次。

标准版牌面：反间——出牌阶段，你可以令另一名角色选择一种花色，抽取你的一张手牌并亮出，若此牌与所选花色不吻合，则你对该角色造成1点伤害。然后不论结果，该角色都获得此牌。每回合限用一次。

[Q]周瑜发动【反间】时，如果目标角色受伤害进入濒死状态，抽到的【反间】牌是【桃】时，是否可以立即使用这张【桃】自救？[A]不可以。目标角色要在【反间】全部结算完毕之后才获得这张【反间】牌。
[Q]周瑜发动【反间】时，在结算过程中，【反间】牌归谁所有？[A]在【反间】没有结算完之前，【反间】的牌始终视为周瑜的手牌。即司马懿可以发动【反馈】获得该牌；如果被【反间】技能伤害后，夏侯惇发动【刚烈】，周瑜可以弃掉该【反间】牌等。但是【反间】全部结算完毕后，无论该【反间】牌在何处（其他角色手上，或者弃牌堆），都由目标角色获得。
例如：周瑜对孙权使用【反间】，孙权猜的花色是红桃，结果翻出来的【反间】牌是方块的【桃】，孙权受伤害进入濒死状态，此时周瑜可以对孙权使用这张【反间】牌（使用后该牌进入弃牌堆），孙权因【救援】技能回复至2点体力，然后孙权再从弃牌堆中拿回这张【反间】牌的【桃】并收归手牌。
[Q]周瑜发动【反间】时，若目标角色受伤死亡，【反间】牌如何处理？[A]【反间】牌将回到周瑜的手牌中。
[Q]小乔抽取周瑜的黑桃，是否算红桃？[A]因为这张牌是周瑜的，因此不能发动【红颜】。
[Q]周瑜【反间】过程中，【反间】牌是否需要一直明示？[A]需要一直明示直到【反间】全部结算完毕。即是周瑜【反间】司马懿时，司马懿发动反馈，此时【反间】牌还处于明示状态。

--]]

