--[[

【迟暮的丞相·诸葛亮】
SHU004　KayaK
武将技：
观星——回合开始阶段，你可以观看牌堆顶的X张牌（X为存活角色的数量且最多为5），将其中任意数量的牌以任意顺序置于牌堆顶，其余以任意顺序置于牌堆底。
空城——锁定技，当你没有手牌时，你不能成为【杀】或【决斗】的目标。

[Q]诸葛亮是否可以先发动【观星】，再对其判定区的延时类锦囊进行判定？[A]可以，如果先判定延时锦囊，则诸葛亮不可再发动【观星】，因为【观星】的发动时间是回合开始阶段，早于判定阶段。
[Q]诸葛亮发动【观星】时，如果剩余的牌堆的张数小于或等于【观星】的张数，如何结算？[A]任何时候，摸牌堆被摸完时，立即将弃牌堆重洗成为新的摸牌堆后再继续游戏。
[Q]诸葛亮发动【观星】时，计算【观星】的张数是否计算诸葛亮自己？[A]是的，比如两人单挑时【观星】的张数是2张。
[Q]诸葛亮处于【空城】状态时，是否可以被指定为【借刀杀人】出【杀】的目标？[A]不可以。
[Q]诸葛亮处于【空城】状态时，貂蝉是否可以指定他为决斗的一方？[A]能，但是必须指定另一名男性角色为先出杀的一方（视为诸葛亮对对方使用了最后一张手牌【决斗】）。
[Q]诸葛亮有一张手牌是【杀】，另一角色对诸葛亮使用【决斗】，诸葛亮打出【杀】，进入空城状态，对方是否可以继续打出【杀】？[A]可以，视为诸葛亮【决斗】失败，诸葛亮受到伤害。
[Q]女性角色装备【雌雄双股剑】对只有一张手牌的诸葛亮使用【杀】，如果诸葛亮选择弃牌，如何结算？[A]诸葛亮的空城状态不能成为【杀】的目标，但是当已经成为【杀】的目标时（即使是在结算过程中进入空城状态），则正常结算【杀】，即诸葛亮受到该【杀】的伤害。此例子如果诸葛亮选择弃牌，则还要受到伤害。
[Q]发动【青龙偃月刀】的技能时，如果在过程中，诸葛亮进入【空城】状态，装备【青龙偃月刀】的角色是否可以对其使用【杀】？[A]不可以。
[Q]没有空城的诸葛亮被指定为方天画戟的杀的目标，等轮到诸葛亮结算时诸葛亮进入空城，如何结算？[A]原则同雌雄双股剑，诸葛亮受到伤害。
[Q]诸葛亮的判定区内有【兵粮寸断】时能否观星？[A]可以。

--]]

