--[[
【借刀杀人】
出牌时机：出牌阶段。
使用目标：除你以外，装备区里有武器牌的一名角色A。（你需要在此阶段选择另一个A使用【杀】能攻击到的角色B）。
作用效果：A需对B使用一张【杀】，否则A必须将其装备的武器牌交给你。
★A使用【杀】时，角色技能和武器技能可以照常发动。

[Q]使用【借刀杀人】时，具体如何操作？[A]首先场上除使用者外，至少有一名角色的装备区里有武器牌，才能使用【借刀杀人】。使用【借刀杀人】时，先指定锦囊的目标（一名有武器的角色），再指定一个杀的目标（目标角色能够进行攻击的另一名角色）。此时如果没有人使用【无懈可击】，则执行锦囊的效果。
[Q]使用【借刀杀人】时，是否必须指定【杀】的对象？[A]必须指定。
[Q]使用【借刀杀人】时，是否可以让被借刀者杀锦囊使用者？[A]可以。
[Q]使用【借刀杀人】时，是否可以要求被借刀者对其自己使用【杀】？[A] 不可以。
[Q]使用【借刀杀人】时，如果获得了被借刀者的武器，是否需要立即装备？[A]不需要，先归入手牌。
[Q]使用【借刀杀人】时，哪些武器的技能可以发动？[A]除了【诸葛连弩】以外的武器，都可照常发动技能，因为【诸葛连弩】的技能发动条件限定为出牌阶段。为锁定技的武器技能必须发动；可选择性发动的武器技能由被借刀者选择是否发动。
例如：青龙偃月刀的连续杀，或者贯石斧的强制命中，都由被借刀的人发动。类似的，A对B使用【借刀杀人】指定杀C，那么B发动方天画戟的特效可以指定ACD为目标。
[Q]使用【借刀杀人】时，是否可以指定没有装备【青釭剑】的被借刀者对装备了【仁王盾】的角色使用黑色的【杀】? [A]可以，如果使用的是黑色的【杀】，那么【杀】无效。
[Q]使用【借刀杀人】时，如果被借刀者杀死了【杀】的目标角色，奖励由谁承担? [A]由被借刀的人承担。如果主公被借刀，出【杀】杀死忠臣，那么主公弃光所有牌及装备区里的牌。
[Q]使用【借刀杀人】时，是否可以指定对方对【空城】状态下的诸葛亮出【杀】？[A]不能，【空城】状态下的诸葛亮不能成为【杀】的目标。
[Q]使用【借刀杀人】时，被借刀的角色是否可以发动自己的武将技?[A]可以发动的武将技必须是在回合外也可发动的技能。
例如：赵云能发动【龙胆】，关羽能发动【武圣】，马超可以发动【铁骑】，张飞不能发动【咆哮】，黄忠不能发动【烈弓】。
[Q]对神关羽使用【借刀杀人】时，神关羽能否打出一张红桃当【杀】？[A]可以。
[Q]对神关羽使用【借刀杀人】时，能否指定神关羽的武器范围之外的角色？[A]不可以。
[Q]对吕布使用【借刀杀人】时，吕布出杀对方需要出几张【闪】？[A]2张。【无双】为锁定技。
[Q]对魏延使用【借刀杀人】时，魏延能否发动【狂骨】技能？[A]必须发动。
[Q]使用【借刀杀人】时，被借刀的角色使用【杀】攻击带有反馈技能的角色成功之后，反馈的对象是谁？[A]是使用【杀】的角色。（如果是刘备发动【激将】则由刘备承担）中间如果遇到转移，则反馈的对象是攻击的源头。例如：对甄姬使用【借刀杀人】杀大乔，大乔发动流离给司马懿。司马懿受到伤害，那么反馈的是甄姬的牌。
[Q]一名角色的攻击范围内没有其他角色，是否可以对其使用【借刀杀人】？[A] 不可以。
例如：对一个装备【诸葛连弩】的角色（但没有装备-1马）使用【借刀杀人】，而他的左右两边都装备了+1马，就不可以对其使用【借刀杀人】，因为不满足发动条件。
[Q]对做主公的刘备使用【借刀杀人】时，刘备是否可以发动【激将】？[A]可以。
[Q]对关羽使用【借刀杀人】时，指定关羽对一个与其距离为1以内的的角色使用【杀】，此时关羽是否可以发动【武圣】将装备的红色武器当【杀】使用？[A]可以。但另一种情况，即若被指定玩家与关羽距离为1以上（不包括1），则此时关羽不可发动【武圣】将装备的红色武器当【杀】使用。
[Q]对一个角色A使用【借刀杀人】时，指定A对诸葛亮使用【杀】，此时诸葛亮只有1张手牌为【无懈可击】，诸葛亮对【借刀杀人】使用【无懈可击】，此时诸葛亮以外的玩家又对诸葛亮使用的【无懈可击】使用了1张【无懈可击】，此时应该如何结算？[A]因为诸葛亮在没有成为【杀】的目标前，已经进入了空城状态，所以无法再对其使用【杀】。此时，A应该将装备的武器交给使用【借刀杀人】的角色。(详细)
[Q]是否可以对自己使用【借刀杀人】？[A]不可以。
[Q]使用【借刀杀人】时，能否指定对装备了【藤甲】的角色使用杀？[A]可以。但是如果所出的是普杀，该杀无效。
[Q]使用【借刀杀人】时，【古锭刀】的特效是否发动？[A]锁定技强制发动。
[Q]使用【借刀杀人】时，【朱雀羽扇】的特效是否发动？[A]由被借刀的角色自己决定。

--]]



import "../global/reg.lua";


local cfg = {
	sid = 'jdsr',
	name = '借刀杀人',
	type = CardType_Strategy,
	
	desc=[==[【借刀杀人】
出牌时机：出牌阶段。
使用目标：除你以外，装备区里有武器牌的一名角色A。（你需要在此阶段选择另一个A使用【杀】能攻击到的角色B）。
作用效果：A需对B使用一张【杀】，否则A必须将其装备的武器牌交给你。
★A使用【杀】时，角色技能和武器技能可以照常发动。]==],

	can_out = {
		[GameEvent_RoundOutCard] = function(cfg, game, event, player, pos_card)
			-- 出牌阶段的检测，只会针对回合玩家。这里不用额外检查是不是。
			-- 出牌阶段总是可以出锦囊牌的。
			return YES;
		end,
	},
	
	event = {
		-- 出牌过程由下列3个事件驱动


		-- 出牌前的准备（如选择目标等，某些技能可以跳过此事件）
		[GameEvent_OutCardPrepare] = function(cfg, game, event, player)
			-- 需要选择一名装备区有武器的玩家A（使用杀者）
			local target = select_target_check(game, event, player, -1, NO, NO, 
					'请为【'..cfg.name..'】的一个装备有武器的目标玩家：', 
					function (t)
						local p = get_game_player(game, t);
						if(get_player_equipcard(p, EquipIdx_Weapon) == nil) then
							return false;
						end
						return true;
					end);
			-- 取消出牌
			if target == nil then
				return R_CANCEL;
			end
			
			local pt = get_game_player(game, target);
			
			-- 再指定杀的目标B（A能攻击的B）
			local sha_target = select_target_check(game, event, target, -1, NO, NO, 
					'再为【'..pt.name..'】的【'..card_sid2name('sha')..'】指定一个目标：',
					function (t)
						if(game_check_attack(game, event, target, sha_target, get_card_id_by_sid('sha'))) then
							return true;
						end
						return false;
					end);
					
			-- 取消出牌
			if sha_target == nil then
				return R_CANCEL;
			end

			-- 如果准备完成应该返回R_SUCC，让出牌过程继续进行下去。
			-- 返回R_CANCEL,则出牌中止，牌不会进入弃牌堆。
			return R_SUCC;
		end,

		-- 出牌的过程驱动
		[GameEvent_OutCard] = function(cfg, game, event, player)
			-- 玩家A出杀，如果不出，则结算效果
			-- （如果此时玩家A无法攻击B,则直接结算效果，视为A不出杀）
			
			
			-- 如果没有特别的驱动过程，则应该返回 R_SUCC，让结算过程继续。
			-- 如果返回R_CANCEL，则出牌过程完成，牌会进入弃牌堆，但不会执行出牌结算过程
			return R_SUCC; 
		end,
		
		-- 出牌后的结算（某些技能可以跳过此事件）
		[GameEvent_OutCardCalc] = function (cfg, game, event, player)
			-- 结算牌的效果，如扣体力，弃目标的牌等等。针对每个目标都会执行结算事件
			-- 得到玩家A的武器牌
			
		end,
	},
};

-- register
reg_card(cfg);


