--[[

【天公将军·张角】
QUN010　LiuHeng
武将技：
雷击——每当你使用或打出一张【闪】时（在结算前），可令任意一名角色判定。若为黑桃花色，你对该角色造成2点雷电伤害。
鬼道——在任意角色的判定牌生效前，你可用自己的一张黑桃或者草花牌替换之。
黄天——主公技，群雄角色可在他们各自的出牌阶段给你一张【闪】或【闪电】。

[Q]张角在结算万箭齐发的时候打出了【闪】，是否能发动【雷击】？[A]可以。
[Q]张角替换的判定牌，是否收归手牌？[A]是。
[Q]张角和司马懿同时在场，判定牌的修改如何结算？[A]从当前回合人开始，按照行动顺序依次修改1次，放弃修改权利的就不能再修改判定了。（注意：类似于夏侯惇的【刚烈】等被动触发的判定，还是从当前回合人开始结算。）
[Q]张角能否用装备区里的牌替换判定？[A]可以。
[Q]张角能否发动八卦阵的特效来发动【雷击】？[A]可以。
[Q]张角发动【雷击】造成曹操的伤害，曹操能否发动【奸雄】？[A]不能。
[Q]张角的【雷击】伤害源头是谁？[A]张角。且该伤害属于雷电伤害。
[Q]主公张角发动【黄天】时，群雄角色给牌时是否必须正面朝上？[A]是的。
[Q]吕布攻击张角，张角出2张【闪】发动几次雷击？[A]2次。如果张角只打出1张【闪】则能发动1次【雷击】。
[Q]张角装备【丈八蛇矛】，打出2张【闪】当【杀】，发动几次雷击？[A]不发动【雷击】。
[Q]张角装备【八卦阵】，需要出闪时判定的结果是红色，能否用这张【八卦阵】更改判定？[A]不能。但是在其他判定时，可以用【八卦阵】更改判定。

--]]

