--[[

【狼顾之鬼·司马懿】
WEI002　KayaK
武将技：
反馈——你可以立即从对你造成伤害的来源处获得一张牌。
★一次无论收到多少点伤害，只能获得一张牌，若选择手牌则从对方手里随机抽取，选择面前的装备则由你任选。
鬼才——在任意角色的判定牌生效前，你可以打出一张手牌代替之。

[Q]司马懿发动【反馈】时，是否可以获得伤害来源角色装备区里的牌？[A]可以，该牌收入其手牌，不可直接置于装备区。
[Q]司马懿发动【反馈】时，是否可以获得伤害来源角色判定区里的牌？[A]不可以，因为判定区里的牌不属于伤害来源角色。
[Q]司马懿发动【鬼才】时，是在判定牌翻出前还是翻出后？[A]在判定牌翻出后。
[Q]司马懿是否可以在同一次判定结算过程中多次发动【鬼才】？[A]不可以。
[Q]司马懿发动【鬼才】，用黑桃2-9代替【闪电】的判定，使角色被【闪电】伤害而死亡，司马懿是否有奖励？[A]【闪电】的伤害视为“天灾”，因此司马懿不承担任何反馈和奖励。
[Q]司马懿进入濒死状态时，是否可以发动【反馈】获得伤害来源处的牌？[A]不可以，除非司马懿被救回。
例如：A角色对司马懿使用【杀】，司马懿受伤害进入濒死状态，如果没有角色对司马懿使用【桃】，则司马懿死亡，该【杀】进入弃牌堆。
[Q]司马懿受到2点或者更多伤害时，发动几次【反馈】？[A]1次。
[Q]司马懿和张角同时改判时如何结算？[A]从当前回合方开始，每个人依次进行一次修改判定牌的机会，如果放弃修改机会则不能再次修改。
[Q]司马懿受到连环传导的伤害时，反馈的对象是谁？[A]伤害来源(可以是自己)。
--]]

