--[[

【嗜血的独狼·魏延】
SHU009　SoniaTang
武将技：
狂骨——锁定技，任何时候，每当你对与你距离为1以内的任意角色造成1点伤害，你回复1点体力值。

[Q]魏延对距离为1以内的角色造成伤害的同时也受到反馈效果自己进入濒死状态，如何结算？[A]首先结算濒死状态，然后再结算【狂骨】。例如：1点体力值的魏延杀小乔，小乔发动【天香】把伤害转移给魏延自己。那么魏延如果求桃被救回，则再结算【狂骨】，回复1点体力。
[Q]满体力值的魏延对小乔造成伤害被小乔转移给魏延自己后，如何结算？[A]魏延首先受到伤害，然后触发【狂骨】回复1点体力值，最后由于没有减少体力因此不摸牌。
[Q]魏延对夏侯惇造成伤害，先结算【狂骨】还是先结算【刚烈】？[A]狂骨。
[Q]魏延对小乔造成伤害，小乔把伤害转移给距离魏延2以上的角色，魏延是否能发动【狂骨】？[A]不能。
[Q]魏延装备【麒麟弓】对一个因装备+1马而距离为2的玩家使用【杀】造成伤害，能发动【狂骨】吗？[A]可以发动。
[Q]由于连环传导，导致魏延对距离为1以内的角色造成伤害，是否发动狂骨？[A]是的，只需魏延作为伤害来源。魏延对自己造成的伤害也能发动狂骨。

--]]

