--[[

【矫情之花·小乔】
WU011　KayaK
武将技：
天香——每当你受到伤害时，你可以弃一张红桃手牌来转移此伤害给任意一名其他角色，然后该角色摸X张牌；X为该角色当前已损失的体力值。
红颜——锁定技，你的黑桃牌均视为红桃牌。

[Q]小乔能否用自己面前的装备牌发动【天香】？[A]不能。
[Q]小乔【天香】转移伤害给只有1点体力值的角色，如何结算？[A]首先目标角色受到伤害进入濒死状态，然后全部结算完毕之后再摸等同于当前已失去体力值的数量的牌。
[Q]小乔天香给司马懿、郭嘉、夏侯惇、曹操、杨修、魏延等角色时，先结算天香的摸牌还是先结算伤害触发的武将技？[A]先结算伤害触发的武将技，最后再结算天香的摸牌。
[Q]小乔受到2点或更多的伤害时，发动【天香】需要几张手牌？[A]1张。
[Q]用【寒冰剑】攻击小乔时，能否发动【天香】？[A]如果对方发动【寒冰剑】特效，那么不能发动【天香】。
[Q]发动【天香】技能时，能否转移伤害给自己？[A]不能，必须是场上的其他角色。
[Q]小乔发动【天香】技能杀死反贼，谁获得奖励？[A]由伤害的源头获得。同理如果主公攻击小乔而造成忠臣死亡，则主公弃光所有手牌及装备。
[Q]处于横置状态的小乔，受到属性伤害发动天香时，如何结算？[A]小乔先发动【天香】，然后把此伤害转移给目标角色。若目标角色也处于横置状态，则触发连环，该伤害传导到小乔，她可以再次发动【天香】。例如：A与小乔均装备【藤甲】并处于连环状态，许褚装备【方天画戟】，发动【裸衣】使用【酒】之后使用最后一张手牌是火【杀】，指定小乔、大乔和A三个角色。小乔把3点火属性伤害天香给A，A受到4点伤害，然后重置武将牌触发连环，传导给小乔，小乔把4点火属性再天香给A，则A受到5点伤害。若大乔流离给A，则A再受到4点伤害，加上方天画戟结算中A受到的4点伤害，A一共受到4+5+4+4=17点伤害。
(此例已按官方最新伤害事件流程修正)

根据官方最新规定，明确“武器技能只对目标有效”，而小乔的天香只是转移伤害，没有改变目标，所以以下几个问题最新答案如下：
1、古锭刀杀小乔，小乔天香给空牌的A，A受几点伤害？ 答案是：1 （此问题8月13日前答案为2）
2、麒麟弓杀小乔，小乔（装备了马）天香给有马的A，谁要被弃马？ 答案是：小乔 （此问题8月13日前答案为A）
3、火攻小乔，如果小乔装备藤甲，火攻成功后小乔转给A，A受到几点伤害？ （此问题可推及铁索连环小乔并传导1点火属性伤害） 答案是：1
4、雌雄双股剑杀小乔，小乔是先选择天香还是先选择弃牌摸牌？ 答案是：小乔先选择弃牌摸牌，才能再发动天香。
5、青釭剑酒杀小乔，小乔天香给装备白银狮子的A，A受到几点伤害？ 答案是：1 （此问题8月13日前答案为 2）

--]]

