--[[

【白银狮子】
防具效果：锁定技，你每次受到伤害时，最多承受1点伤害（防止多余的伤害）；当你失去装备区里的【白银狮子】时，你回复1点体力。

[Q]白银狮子在手牌中失去时，能否发动回复效果？[A]不能。
[Q]满体力值时失去装备区里的白银狮子能否发动回复效果？[A]不能。
[Q]用其他防具替换装备区里的白银狮子时能否发动回复效果？[A]可以。能发动白银狮子回复效果的情况有：顺手牵羊或过河拆桥失去此装备，替换防具，制衡，反馈，贯石斧，寒冰剑，神速，流离，离间，奇袭，鬼道，主公杀死忠臣等。
[Q]小乔发动【天香】把超过1点的伤害转移给装备【白银狮子】的角色，其受到几点伤害？[A]1点。
[Q]装备【白银狮子】的角色受到属性伤害并触发连环，其他连环状态的角色受到几点伤害？[A]1点（藤甲除外）。
[Q]装备【青釭剑】使用【酒】后出杀攻击装备【白银狮子】的角色时，能否造成多于1点的伤害？[A]可以。
[Q]装备【青釭剑】对装备【白银狮子】的角色使用其他攻击或伤害手段时，能否造成多于1点的伤害？[A]不可以。例如天香或者裸衣决斗等。
[Q]失去装备区里的白银狮子时能否放弃回复体力？[A]不能。

--]]

