--[[
【方天画戟】
攻击范围：４
武器特效：当你使用的【杀】是你的最后一张手牌时，你可以为这张【杀】指定至多三名目标角色，然后按行动顺序结算之。

[Q]发动【方天画戟】的技能时，是否可以只攻击一名或者两名角色？[A]可以。
[Q]发动【方天画戟】的技能时，如果【方天画戟】被【反馈】或者攻击者被【刚烈】或者【雷击】等技能致死后，是否继续结算？[A]是。除非满足游戏结束的条件。
[Q]发动【方天画戟】技能时，诸葛亮是杀的目标之一，但是轮到诸葛亮结算时他成为【空城】状态，此时如何结算？[A]【空城】状态的诸葛亮不能成为杀的目标，对于已经成为目标的情况下，正常结算，诸葛亮受到该杀的伤害。
[Q]发动【方天画戟】的技能时，大乔是【方天画戟】的攻击对象之一，她发动【流离】技能将【杀】的目标转移给另一个被【方天画戟】攻击的角色时，如何结算？[A]被【流离】的角色视为受到先后两张【杀】的攻击。注意，大乔必须在成为【杀】指定的目标时即刻发动流离，而不是在【杀】结算到大乔时才发动。同时，如果这个例子中大乔【流离】的对象是曹操，且曹操受到两次伤害，也只能发动【奸雄】收那一张【杀】。
例如：一名角色发动【方天画戟】技能，攻击ABC（按行动顺序），C为大乔，在该角色使用【杀】时，大乔就要先选择是否流离，如果A已经开始结算，则大乔不能再发动【流离】。
[Q]无手牌的刘备装备了【方天画戟】，如果刘备【激将】使用【杀】是否可以发动【方天画戟】的技能？[A]不能，发动【方天画戟】的技能条件必须是使用自己最后一张手牌。
[Q]夏侯渊发动【神速】，装备了【方天画戟】并且打出自己手中的最后一张手牌是装备牌，能否发动特效？[A]不可以。
--]]
