--[[
一、出牌阶段对自己使用，令本回合下一张杀所造成的伤害+1。
★一回合只能使用一次。
二、当你处于濒死状态时，对自己使用，立即回复一点体力。
★不能对他人使用酒。

[Q]其他角色进入濒死状态时，能否用【酒】救援？
[A]不能。酒的自救效果仅对自己有效。

[Q]使用【酒】之后，能否使决斗造成的伤害+1？
[A]不能。酒的伤害效果仅对杀的结算过程有效。类似地，南蛮入侵、万箭齐发、火攻等等均不受酒的效果影响。

[Q]在自己回合内，当自己进入濒死状态使用【酒】救活后，使用的杀是否造成+1伤害？
[A]否。酒的伤害效果与酒的自救效果互相独立。

[Q]在自己回合内，当自己进入濒死状态使用【酒】救活，能否继续使用【酒】然后出杀？
[A]可以。

[Q]发动【酒】的伤害效果时，是否须在使用【酒】之后立即出【杀】？
[A]否，使用【酒】之后在这本回合内均有效。

[Q]使用【酒】之后装备了【诸葛连弩】或者张飞的【咆哮】技能连续出【杀】，是否每一张杀的伤害均+1？
[A]否，【酒】只对第一张【杀】有效。如果要求对后面打出的杀发动酒的伤害效果，则必须在那张【杀】使用前对自己使用【酒】。

[Q]使用了【酒】之后没有出杀，那么下一个回合时自己所出的【杀】是否伤害+1？
[A]否，酒的伤害效果仅在本回合有效。

[Q]使用了【酒】之后，能否选择不发动酒的伤害效果？
[A]不能，酒的伤害效果是强制生效的，即使造成伤害的并非你最初的攻击目标。

[Q]在进入濒死状态时，能否使用2张或2张以上的【酒】或者同时使用【酒】和【桃】？
[A]可以。

[Q]甘宁发动【奇袭】时用黑色【酒】当【过河拆桥】之后，能否再使用【酒】？
[A]可以，类似地，甄姬、大乔、小乔、貂蝉等角色在发动各自武将技时，均可以把【酒】作为武将技能的消耗，然后再使用【酒】。

--]]

