--[[
出牌时机：出牌阶段。
使用目标：除你以外，任意一名角色。
作用效果：由目标角色先开始，你和他（她）轮流打出一张【杀】，【决斗】对首先不出【杀】的一方造成1点伤害；另一方成为此伤害的来源。

★使用【决斗】有可能让自己受伤，关于来源的解释请看“用语集”。

[Q]使用【决斗】时的伤害来源如何界定？[A]【决斗】的获胜方是伤害来源。
例如：貂蝉发动【离间】指定司马懿和夏侯惇决斗，司马懿受到伤害，那么【反馈】的对象是夏侯惇。
例如：貂蝉发动【离间】指定主公和忠臣决斗，如果忠臣死亡，则主公需要弃光所有手牌和装备。
[Q]使用【决斗】时，在玩家打出【杀】或不能打出【杀】后，是否可以使用【无懈可击】抵消【决斗】的效果？[A]不可以。【无懈可击】只能在【决斗】生效前使用，抵消锦囊效果（【决斗】的一方开始出【杀】或者表态不出【杀】视为【决斗】生效），【决斗】一旦生效就不能再抵消。
[Q]是否可以对自己使用【决斗】？[A]不可以。
[Q]使用【决斗】但尚未开始结算时，如果决斗的一方已经死亡，另一方是否仍然需要出杀？[A]需要，否则受到伤害。例如：1点体力值的角色使用【决斗】，于吉蛊惑【无懈可击】，质疑后为真然后造成该角色死亡，【无懈可击】作废，于吉仍需出杀，否则受到伤害。
[Q]决斗造成的伤害是什么属性？[A]决斗造成的是普通伤害，无法触发连环。
--]]
