--[[
【铁索连环】
定义：连环，出牌阶段使用，选择1至2个角色，分别横置或重置这些角色。处于“连环状态”。重铸，出牌阶段，你可以从手里弃掉这张牌，然后摸1张牌。

[Q]黄月英发动【铁索连环】的重铸效果时，能否发动【集智】？[A]不能。当你重铸【铁索连环】时，你并没有使用它。
[Q]使用【铁索连环】时，能否用无懈可击抵消？[A]重铸【铁索连环】不能被无懈可击，当发动连环效果时，无懈可击抵消其对某一角色的效果。
[Q]处于连环状态的角色，受到伤害时如何结算？[A]当连环状态的角色受到普通伤害时（如普杀、决斗、南蛮入侵、万箭齐发等），正常结算，且不解除连环状态。而当其受到属性伤害时（火焰伤害：使用火杀命中，神周瑜的【业炎】技能或者火攻成功造成的伤害或雷电伤害：使用雷杀命中，张角的【雷击】技能或者闪电造成的伤害），则从其开始触发连环。该伤害按照行动顺序，同属性、同程度地依次传导到每一个连环状态的角色，同时这些角色重置，解除连环状态。
[Q]当A与B处于连环状态时，对C与D使用【铁索连环】，那么此4人是否处于同一连环状态？[A]是，当其中1个角色受到属性伤害时，4人一同受到该伤害。
[Q]连环状态中的角色受到伤害发动相应技能时如何结算？[A]刚烈、反馈等技能的对象均为伤害来源而非触发连环的角色。当这些技能结算完毕后再结算下一个连环状态的角色受到的属性伤害。
[Q]场上只有1个角色处于连环状态时，受到属性伤害是否需要重置？[A]需要。
[Q]处于连环状态的小乔受到属性伤害并发动【天香】，是否需要重置？[A]不需要。小乔发动天香时不会触发连环。
[Q]处于连环状态的小乔受到属性伤害并天香给同在连环状态下但尚未结算连环伤害的角色，如何处理？[A]该角色受到属性伤害，解除连环状态，不再触发连环并结算天香摸牌。随后之前的连环伤害继续结算。
[Q]连环状态的角色受到传导的伤害死亡，由谁承担奖惩？[A]最初的伤害源头。如果在结算奖惩时，伤害源头已经死亡，则无人承担奖惩。只要满足游戏结束条件出现，则中止结算，游戏结束。

1月21日新增：
1、先铁索连环AB，再铁索连环CD，这时候ABCD是否在同个连环，还是在两个连环？
ABCD在同个连环，铁索连环是一个状态，而不是一条一条绳子，所以只要被铁索连环影响而横置身份牌的玩家全都处于同一个铁索连环的状态。
2、铁索连环过程中，比如ABCD连环，如果A受到1点火属性伤害，从而触发连环，B有藤甲，CD没有，这时BCD各受到多少伤害？
在没有其他条件的前提下，这时B受到1+1=2点火属性伤害，CD仍然受到1点火属性伤害，也就是说，铁索连环中的玩家受到的伤害=第一个受伤害并触发铁索连环的玩家所收到的伤害+自己装备可能发生的加成或者限制，跟自己的上家（非触发者）没有关系。
3、如果ABCD铁索连环，B是小乔，A受到1点火属性伤害，B天香给C，这时候各人的受伤害情况和武将牌状态各在什么时刻发生变化，最后是什么状态？这是A受到1点火属性伤害，武将牌重置；B天香给C，C受到1点火属性伤害，同时马上重置武将牌，B因为自己没有收到伤害，所以武将牌不重置，仍然处于铁索连环状态；C不会再受到A传过来的铁索连环伤害，因为被天香后已经重置；D仍然受到A引发的铁索连环伤害，受到1点火属性伤害。
4、可否对1个玩家铁索连环？
可以，比如先对A出铁索连环，然后再对BC出一张铁索连环，则ABC处于同个连环状态。
--]]
