--[[
【青釭剑】
攻击范围：２
武器特效：锁定技，当你使用【杀】攻击时，无视该角色的防具。
★对方的防具没有任何效果，直到目标角色对【杀】的响应结束。

[Q]装备了【青釭剑】使用【杀】时，是否可以不发动【青釭剑】的技能？[A]不可以，该技能为锁定技。
[Q]装备了【青釭剑】是否可以对装备了【仁王盾】的角色用黑【杀】攻击？对方是否需要出【闪】？[A]可以，对方需要出【闪】。【青缸剑】的锁定技是无视防具，同时也无视【仁王盾】的技能效果。
[Q]青釭剑的特效在其他造成伤害的方式结算时能否发动特效？[A]不能。例如：装备了【青釭剑】的角色使用万箭齐发时，装备【八卦阵】的角色可以判定出闪。

青釭剑启动与终止的时机（资料来源）
杀成功指定目标后，效果开始。（如果目标是大乔，流离在先，被流离的目标是杀成功指定的目标）
目标对杀的响应结束----结束。（最终的结果有两种，被闪抵消，或不出闪受到伤害）
从开始到结束之间视为目标角色没有此防具般的进行结算

[Q]庞德装青釭剑杀装备白银狮子的角色，杀被闪抵消后发动猛进弃掉白银狮子是否回复体力。[A]回复体力。被闪抵消后，青釭剑的效果结束。
[Q]装备青釭剑杀张角，张角出闪发动雷击，用装备的白银狮子发动鬼道，张角是否回复体力。[A]不回复体力。张角发动雷击是在闪结算前，此时仍处于青釭剑效果时间内。
[Q]小乔与A连环，装备青釭剑火杀藤甲小乔，天香连环中的A，伤害传回给小乔，小乔不天香，受到几点伤害。[A]2点。青釭剑的效果结束，并且连环传导的伤害相对独立，只是来源、属性、相同。
[Q]太史慈装青釭剑杀张角和A，A装白银狮子，张角出闪雷击A，A受几点伤害？[A]2点。太史慈成功指定了两个目标，他们的防具在青釭剑效果结束前一直无效。
[Q]太史慈装备青釭剑，杀主公曹操和带八卦阵的郭嘉，曹操发动护驾，郭嘉能否判定八卦阵？[A]不能。
[Q]张角装备青釭剑，杀主公曹操，曹操装备八卦阵。曹操发动护驾，魏将A判定八卦阵为红色，张角发动鬼道用青釭剑改判定，改为黑色，魏将不再出闪。此时曹操还能否再判定八卦阵？[A]不能。
--]]
