--[[
【闪电】
出牌时机：出牌阶段。
使用目标：你。
作用效果：将【闪电】横置于目标角色判定区里，目标角色回合判定阶段，进行判定；若判定结果为黑桃2-9之间（包括黑桃2和9），则【闪电】对目标角色造成3点伤害，将闪电弃置。若判定结果不为黑桃2-9之间（包括黑桃2和9），将【闪电】移动到当前目标角色下家（【闪电】的目标变为该角色）的判定区。

★【闪电】的目标可能会不断地进行改变，直到它生效。若它被抵消，则将它直接移动到下家的判定区里（而不是判定后再移动）。
★【闪电】造成的伤害没有来源。

[Q]是否可以在同一个角色面前放置多个【闪电】？[A]不能。如果上一个【闪电】判定结束之后下家（按照行动顺序）的判定区里已经有【闪电】，那么直接跳过下家传给再下一家（按照行动顺序）。
[Q]当自己的判定区里有两个或更多的延时锦囊时，如何判定？[A]首先判定后放置的，然后再判定先放置的。
[Q]面前已经放置【闪电】的角色死亡之后，【闪电】如何处理？[A]弃掉。
[Q]黄月英是否可以把【闪电】放置在其他角色面前？[A]不能。【闪电】的使用对象是你自己。
[Q]【闪电】造成判定的角色死亡后，如何计算奖惩？[A]闪电造成的伤害没有来源。无论是目标角色自己翻开判定牌为黑桃2-9，还是其中有角色改了判定牌为黑桃2-9，闪电杀死的角色都视为被“天灾”影响而死，不进行任何奖励或者惩罚。神关羽被【闪电】杀死之后，根据之前已有的标记进行【武魂】结算，闪电没有标记对象。
[Q]当使用【闪电】时，能否立刻使用【无懈可击】？[A]不能，必须到下一次自己回合的判定阶段使用【无懈可击】把闪电移动到下家的判定区。
[Q]闪电的伤害属性是什么？[A]闪电造成的是雷电伤害，因此可以触发连环。
--]]

