--[[

【疾行的猎豹·夏侯渊】
WEI008　KayaK
武将技：
神速——你可以选择以下一至两项：1.跳过你该回合的判定阶段和摸牌阶段2.跳过你该回合出牌阶段并弃一张装备牌你每做出上述之一选择，视为对任意一名其他角色使用了一张【杀】。

[Q]发动【神速】2时，装备牌能否从手牌中打出？[A]可以。
[Q]能否先发动【神速】1，然后再决定是否发动【神速】2？或者先摸牌，然后摸到了装备牌再发动【神速】2？[A]可以。例如：夏侯渊发动【神速】1，杀死了反贼，摸到的3张牌里面有装备牌，则可以继续发动【神速】2。
[Q]发动【神速】时，攻击距离如何计算？[A]【神速】可以对任意距离玩家攻击。
[Q]发动【神速】时，【杀】的颜色如何判定？[A]视为无色的【杀】。
[Q]发动【神速】对曹操造成伤害时，曹操能否发动【奸雄】？[A]不能，因为不能获取任何牌。神速2的弃牌是技能的消费，不作为造成伤害的牌。
[Q]发动【神速】时，能否发动武器特效？[A]可以。除了【诸葛连弩】、【丈八蛇矛】和【方天画戟】之外。
[Q]夏侯渊的判定区里有延时锦囊的时候，能否先求【无懈可击】，没有人打出后再选择发动神速1？[A]不能。
[Q]如果判定【乐不思蜀】未通过，能否发动【神速】2？[A]不能。
[Q]夏侯渊发动【神速】时，杀的属性如何决定？[A]除非装备了【朱雀羽扇】，否则均视为无色无点的普杀。若装备了【朱雀羽扇】，发动【神速】可以视为使用了火杀。
[Q]夏侯渊能否在回合外发动【神速】？[A]不能。

--]]

