--[[
【贯石斧】
攻击范围：３
武器特效：目标角色使用【闪】抵消你使用【杀】的效果时，你可以弃两张牌，则【杀】依然造成伤害。

[Q]发动【贯石斧】的技能时，是否可以弃掉自己装备区里的牌？[A]可以，除了【贯石斧】本身。例如：孙尚香弃掉装备发动贯石斧特效，可以发动【枭姬】。
[Q]装备【贯石斧】使用【杀】攻击曹操时，发动武器技能命中了曹操，曹操发动【奸雄】收什么牌？[A]收对曹操造成伤害的【杀】。
[Q]装备【贯石斧】的陆逊，发动武器技能，是否可以先弃掉一张手牌，发动【连营】，再弃掉一张发动【贯石斧】的技能？[A]不能。因为弃两张牌必须是同时弃掉。
[Q]发动【贯石斧】的技能攻击距离为3角色时，是否可以弃掉已经装备的一1【马】来发动【贯石斧】的技能（即弃牌之后目标不在攻击范围内了）？[A]可以。
[Q]装备【贯石斧】使用【杀】攻击只有一张手牌为【闪】的诸葛亮时，诸葛亮出【闪】后进入空城状态，是否可以发动【贯石斧】武器技能并造成诸葛亮的伤害？[A]可以，因为诸葛亮已经成为【杀】的目标，在【贯石斧】技能发动后，诸葛亮要受到伤害。
[Q]装备【贯石斧】，攻击张角，如何结算？[A]如果张角使用了【闪】，可以发动【雷击】。【雷击】结算之后攻击者（如果还存活）可以选择是否弃牌强制命中。
--]]
