--[[

【火攻】
定义：出牌阶段，对任一有手牌的角色使用。目标角色展示1张手牌，若你弃置1张与之相同花色的手牌，则你对目标角色造成1点火焰伤害。

[Q]能否对没有手牌的角色火攻？[A]不能。
[Q]能否对自己使用【火攻】？[A]可以。但如果自己手中只有最后1张手牌【火攻】时，不能对自己火攻，因为不满足锦囊的发动条件。
[Q]火攻自己时，能否展示和弃置同一张手牌？[A]可以。若如此做，则自己对自己造成1点火焰伤害，同时触发相关的技能结算（例如奸雄、遗计、反馈、刚烈、狂骨、天香、以及铁索连环的效果等）
[Q]被火攻的目标角色展示了手牌之后，能否使用【无懈可击】抵消火攻？[A]不能。被火攻的目标展示手牌时视为锦囊已经开始结算。
[Q]被火攻的目标角色展示的手牌是否必须永久展示？[A]不需要。在展示手牌给所有角色知晓后，这张牌可以收回手牌恢复不可见。
[Q]被火攻的角色展示了手牌之后，火攻发动者能否弃一张与所展示的手牌不同花色的牌并且不造成伤害？[A]不能。
[Q]使用火攻后，若结算时，目标角色已无手牌，如何处理？[A]视为火攻失败，已经打出的【火攻】不可收回。
[Q]陆逊使用最后一张手牌【火攻】之后，能否弃置连营获得的手牌来造成伤害？[A]可以。同理黄月英可以弃置集智获得的手牌。
[Q]对小乔火攻时，若小乔展示了一张黑桃手牌，则发动者应弃置红桃手牌还是黑桃手牌？[A]红桃手牌，小乔的【红颜】为锁定技。类似地，小乔火攻其他角色时，若展示的手牌花色为黑桃，则小乔无法火攻成功。

--]]

