--[[
【无懈可击】
出牌时机：目标锦囊对目标角色生效前。
使用目标：目标锦囊。
作用效果：抵消该锦囊对其指定的一名目标角色产生的效果。

★【无懈可击】是1张可以在其他锦囊开始结算时使用的锦囊，它只能抵消目标锦囊对一名指定角色产生的效果。
★【无懈可击】本身也是锦囊，所以也可以被抵消。
★当【无懈可击】抵消【闪电】的效果后，【闪电】不会被弃置，而是继续传递给下家（见【闪电】段落）。

[Q]【无懈可击】是否只有在自己的出牌阶段才能使用？[A]不是，游戏中任何阶段，只要有角色使用了非延时类锦囊或者在延时类锦囊判定前，都可以对该锦囊牌使用【无懈可击】
[Q]当锦囊指定超过一名角色为目标时，是否对该锦囊可以使用【无懈可击】？[A]可以，但使用1张【无懈可击】只能抵消目标锦囊对某—名角色的影响。例如：一名角色对所有其他角色使用【南蛮入侵】，到A角色结算时，任何一名角色都可以在A角色结算时（A尚未出【杀】或者受伤之前）对【南蛮入侵】使用【无懈可击】，抵消【南蛮入侵】对A角色的影响。
[Q]是否可以在一个锦囊结算过程中使用多张【无懈可击】？[A]可以，后面的1张【无懈可击】视为抵消前面1张【无懈可击】的效果。例如：某角色对A角色使用【顺手牵羊】，B角色对【顺手牵羊】使用【无懈可击】，C角色再对B角色使用的【无懈可击】使用【无懈可击】，则B角色使用的第一张【无懈可击】被C角色使用的第二张【无懈可击】抵消，A角色仍然受到【顺手牵羊】的影响。
[Q]使用【过河拆桥】、【顺手牵羊】或者【借刀杀人】等已经获取了牌时，能否无懈可击？[A]不能。锦囊一旦生效，则不可再使用【无懈可击】。对于无中生有来说，开始摸牌即视为生效；过河拆桥、顺手牵羊和五谷丰登来说，指定目标牌时即生效；对决斗、借刀杀人、南蛮入侵和万箭齐发来说，出杀（闪）或造成伤害或判定八卦阵或发动【激将】（【护驾】）或使用【酒】或求桃开始即视为生效；对闪电、乐不思蜀和兵粮寸断来说，翻开判定牌即视为生效；对火攻来说，对方展示手牌即视为生效；对铁索连环来说，横置或重置武将牌即视为生效；对桃园结义和无懈可击来说，使用时立即生效。
[Q]能否使用【无懈可击】抵消【桃】或者武将技？[A]不能抵消【桃】，因为这不是锦囊。武将技是否可以被无懈可击要视情况。例如：甘宁的【奇袭】可以被无懈可击，但貂蝉的【离间】技能不能被无懈可击。
[Q]是否可以在没有人使用锦囊的时候凭空使用【无懈可击】？[A]不可以。【无懈可击】必须用来响应某个锦囊，不能凭空使用。
[Q]无懈可击是否可以对自己使用？[A]无懈可击的对象是目标锦囊，与角色无关。
--]]
